game-bot/src/Documents/ПрохождениеКвеста/ПрохождениеКвеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеКвеста</name>
  <posting>Deny</posting>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиТелеграм</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>CatalogRef.РасшифровкиТестаСРасшифровкой</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вопросы</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.ВопросыКвеста</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

game-bot/src/Documents/ПрохождениеКвеста/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ первые 1
		|	ВопросКвеста.Ссылка КАК Вопрос
		|ИЗ
		|	Справочник.ВопросыКвеста КАК ВопросКвеста
		|ГДЕ
		|	ВопросКвеста.Активность
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВопросКвеста.Код";
	
	Вопросы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
Процедура ПодвестиРезультат()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасшифровкаТестаСРасшифровкой.Ссылка
		|ИЗ
		|	Справочник.РасшифровкиТестаСРасшифровкой КАК РасшифровкаТестаСРасшифровкой
		|ГДЕ
		|	&ИтогоБаллов МЕЖДУ РасшифровкаТестаСРасшифровкой.НачалоДиапазона 
		|		И РасшифровкаТестаСРасшифровкой.КонецДиапазона";
		
	Запрос.УстановитьПараметр("ИтогоБаллов", ИтогоБаллов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 1 Тогда
		ВызватьИсключение СтрШаблон(Нстр("ru = 'Для суммы баллов %1 найдено более одного результата'"));
	КонецЕсли;
	
	Если Выборка.Количество() = 0 Тогда
		ВызватьИсключение СтрШаблон(Нстр("ru = 'Для суммы баллов %1 не найдено результата'"));
	КонецЕсли;
	
	Выборка.Следующий();
	Результат = Выборка.Ссылка;
	
КонецПроцедуры
	
#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
